[{"ID":"B7117","PRO":"Gresh (Stars)","GRAP":"Gresh.jpg","COST":"7.69","MSRP":"10.99","QTYH":"10","QTYB":"30","ITEM":"Powerful Glatorian! Now a veteran Glatorian with the elemental power of air, Gresh is ready to make new allies and fight new foes to keep his people free. Gifted with elemental power by Mata Nui, he will use the skills he learned in the arena and in battle with Skrall to fight off the armies of Makuta. Includes one of six golden armor pieces. Gresh, a BIONICLE hero, is equipped with 2 blades! Build a Golden BIONICLE! Collect all 6: 7116 Tahu, 7117 Gresh, 7135 Takanuva, 7136 Skrall, 7137 Piraka and 7138 Rahkshi!","BRAND":"Bionicle"},
 {"ID":"B70785","PRO":"Pohatu Master of Stone","GRAP":"Pohatu.jpg","COST":"12.59","MSRP":"17.99","QTYH":"10","QTYB":"30","ITEM":"Match Pohatu – Master of Stone against the Skull Spider! Summon the awesome elemental power of Pohatu – Master of Stone to defeat the Skull Spider! Attach the convertible Jeterangs to the feet of this powerful, posable BIONICLE figure and launch into the sky. When you locate the Skull Spider, transform the Jeterangs into 2 huge Stormerang weapons and get ready to battle for the Golden Mask of Stone. Resist all attempts to pop off Pohatu s mask, and activate the bashing battle arm to send the Skull Spider flying! Features a BIONICLE head with mask and mask pop-off trigger, 3 BIONICLE shells, tribal chest decoration, 2 convertible Jeterangs Stormerang weapons, wheel-operated bashing battle arm function and posable joints. Also includes the Golden Mask of Stone and a dark blue Skull Spider. Zoom through the air on the convertible Jeterangs. Transform the Jeterangs into 2 awesome Stormerang weapons. Turn the wheel to power up the bashing battle arm. Don t let the Skull Spider pop off Pohatu s mask!. Battle for the Golden Mask of Stone. Highly posable and durable for intense action play. Combine with 70779 LEGO BIONICLE Protector of Stone using building instructions available at LEGO.com BIONICLE to power up for ultra elemental battle! Stands over 7 (18cm) tall.","BRAND":"Bionicle"},
 {"ID":"B70788","PRO":"Kopaka Master of Ice","GRAP":"Kopaka.jpg","COST":"17.49","MSRP":"24.99","QTYH":"5","QTYB":"10","ITEM":"Ski through an avalanche with Kopaka! Prepare for a chilling mountaintop conflict with Kopaka – Master of Ice! Watch out for the Skull Spider crawling from the snow, trying to pop off Kopaka s mask. Adjust the arms and legs of this heavily armored figure to create fearsome battle poses. Fend off the evil creature s attacks with the frost shield, bashing battle arm and the mighty Elemental Ice Spear. Get to the precious Golden Mask first then convert the shield into avalanche skis to escape. Features a BIONICLE head with mask and mask pop-off trigger, tribal chest and leg decoration, Elemental Ice Spear, convertible frost shield avalanche skis, wheel-operated bashing battle arm function and posable joints. Also includes the Golden Mask of Ice and a silver-colored Skull Spider. Fend off the Skull Spider with the frost shield. Convert the shield into avalanche skis. Turn the wheel to power up the bashing battle arm. Resist the Skull Spider s attempts to pop off Kopaka s mask! Battle for the Golden Mask of Ice. Highly posable and durable for intense action play. Combine with 70782 LEGO BIONICLE Protector of Ice using building instructions available at LEGO.com BIONICLE to power up for ultra elemental battle! Stands over 7 (19cm) tall.","BRAND":"Bionicle"},
 {"ID":"B70791","PRO":"Skull Warrior","GRAP":"Skull_Warrior.jpg","COST":"12.59","MSRP":"17.99","QTYH":"10","QTYB":"30","ITEM":"Turn the wheel to activate the battle arm. Rip off LEGO BIONICLE hero masks with the hook blade. Fire the Freeze Bow rapid shooter; durable design for intense action play. Stands over 7-Inch (20cm) tall. Combine with 70792 Skull Slicer and 70793 Skull Basher to create a multi-headed warrior using online building instructions at LEGO.com BIONICLE bi.","BRAND":"Bionicle"},
 {"ID":"B71309","PRO":"Onua Uniter of Earth","GRAP":"Onua.jpg","COST":"17.49","MSRP":"24.99","QTYH":"5","QTYB":"15","ITEM":"Go underground with Onua Uniter of Earth! Drill through the jagged tunnels of Okoto! Gentle giant Onua Uniter of Earth can earn respect from the other Toa with his wisdom and guidance—when he s not keeping them awake with his deafening snoring! Dig shortcuts under the mountains of Okoto and team up with island s creatures to take on the evil Umarak! Onua Uniter of Earth features a BIONICLE head with mask pop-off trigger, Unity Mask of Earth, armor chest plate with rune decorations, unity piece to attach creatures and posable joints. Weapons include blasting crystal drill hammer and crystal six shooter. Accessory elements include Golden Unity Mask of Earth and elemental armor of earth. Twist the torso wheel to wield the weapons. Pop the trigger of the Toa s BIONICLE head to release the Unity Mask of Earth and power up with the Golden Unity Mask of Earth. Sturdy design for intense action play. Stands over 8 (22cm) tall. Combine with 71304 Terak Creature of Earth in one simple click with the unity piece, and create powerful armor. Switch with other creatures in the 2016 LEGO BIONICLE series to create new combinations of battle powers.. Go to LEGO.com BIONICLE for building instructions, games, animations and more. Ask your parents  or guardians  permission before going online.","BRAND":"Bionicle"},
 {"ID":"HF6223","PRO":"Bulk (Breakout)","GRAP":"Bulk.jpg","COST":"11.19","MSRP":"15.99","QTYH":"10","QTYB":"30","ITEM":"Target the villains with BULK! Calling BULK! The villains are fleeing Hero Factory and must be recaptured! We ve equipped you with a powerful missile launcher, hero plasma shooter, high-impact shoulder armor, pinpoint laser targeting and hero cuffs. Get the villains in your sights and bring them home – cuffed! Features hero cuffs, plasma ball shooter, missile launcher, high-impact shoulder armor and laser targeting. Decorated chest piece. Highly flexible and poseable elements. Includes unique code worth 300 game points for LEGO Hero Factory BREAKOUT game online at www.HeroFactory.LEGO.com. Fire the plasma ball shooter! Battle with the villain 6222 CORE HUNTER! Combine with 6222 CORE HUNTER for an even bigger model! Stands over 9 (23cm) tall!","BRAND":"Hero Factory"},
 {"ID":"HF6229","PRO":"XT4","GRAP":"XT4.jpg","COST":"8.39","MSRP":"11.99","QTYH":"15","QTYB":"20","ITEM":"Teach the heroes the meaning of tough with XT4! Attention heroes! XT4 has escaped from the Hero Factory and fled to his home planet, Mechna. It won t be easy to cuff any one of his 4 arms, equipped with razor disc slicers, 2 striking blades and a laser slicer! Be extra careful around this heavy-metal robot! Features cyborg eye, razor disc slicer, 2 striking blades and laser slicer. Highly flexible and poseable elements. Includes unique code worth 200 game points for LEGO Hero Factory BREAKOUT game online at www.HeroFactory.LEGO.com. Defend XT4 against the heroes with his 4 slicing and striking arms! Battle with the hero 6221 NEX! Combine with 6221 NEX for an even bigger model! Stands over 6 (17cm) tall!","BRAND":"Hero Factory"},
 {"ID":"HF6282","PRO":"Stringer (Breakout)","GRAP":"Stringer.jpg","COST":"8.39","MSRP":"11.99","QTYH":"10","QTYB":"30","ITEM":"Give the villains a noisy reception with STRINGER! Please respond, STRINGER! The villains are on the run from the Hero Factory and must be intercepted! To battle some extra-special villains, we ve suited you up with advanced amplified armor, sonic speakers, a powerful sonic blaster and hero cuffs. It s time to track those villains down and cuff them! Features amplified armor, sonic speakers, sonic blaster, decorated chest piece and hero cuffs. Highly flexible and poseable elements. Includes unique code worth 200 game points for LEGO Hero Factory BREAKOUT game online at www.HeroFactory.LEGO.com. Shoot the sonic blaster! Battle with the villain 6283 VOLTIX! Combine with 6283 VOLTIX for an even bigger model! Stands over 6 (16cm) tall!","BRAND":"Hero Factory"},
 {"ID":"HF44002","PRO":"Rocka (Brain Attack)","GRAP":"RockaBA.jpg","COST":"8.39","MSRP":"11.99","QTYH":"15","QTYB":"30","ITEM":"Cut the evil brains down to size with ROCKA! Head for the LEGO Hero Factory briefing room immediately, ROCKA! The evil brains are rampaging through the galaxy and must be defeated. This is one tough mission, so you have been equipped with LEGO Hero Factory Recon Team weapons: a plasma blade sword, a 360-degree spinning razor shield, armored visor and hero core locking clamps. With equipment like this, you re ready for anything those evil brains can throw at you! Features plasma blade sword, spinning 360-degree razor shield, armored visor and hero core locking clamps. Includes highly durable and poseable design with gold and translucent green elements. Battle with the Recon Team s plasma blade sword! Spin the 360-degree razor shield! Lock the clamps and protect the hero core! Battle with 44003 SCAROX! Combine with 44003 SCAROX using building instructions available at LEGO.com herofactory. Also includes unique code worth 400 game points for LEGO Hero Factory Brain Attack mobile app and online game at www.LEGO.com herofactory. Stands over 7 (18cm) tall.","BRAND":"Hero Factory"},
 {"ID":"HF44017","PRO":"STORMER Freeze Machine","GRAP":"Freeze_Machine.jpg","COST":"12.59","MSRP":"17.99","QTYH":"5","QTYB":"10","ITEM":"Turn the invaders to ice with STORMER Freeze Machine! Get ready for battle, STORMER! In the fight to take back the city streets from giant beasts and wild little jumpers, your new Freeze Machine suit is a game-changer. Strap yourself in and support the other heroes. Fire missiles at the invaders and freeze them with the rotating ice blaster. Then capture the jumpers in the cryo chamber for analysis back at LEGO Hero Factory. Includes STORMER mini robot with a weapon and accessory. Includes STORMER mini robot with a weapon and accessory. Features a detachable seat, adjustable visor, flick missile shooter, rotating ice blaster, cryo chamber and translucent elements. Includes 2 jumpers – make them jump with a flick of your finger! Fire the flick missiles and fend off the beasts. Attack with STORMER s gun. Call for hero backup on the com device. Freeze jumpers with the powerful rotating ice blaster. Capture jumpers in the cryo chamber. Combine with 44019 ROCKA Stealth Machine for an even bigger hero model using building instructions available at LEGO.com herofactory. Power up the massive 44022 EVO XL Machine by attaching weapons from STORMER Freeze Machine so the heroes can battle the huge beasts. Stands over 6 (17cm) high.","BRAND":"Hero Factory"},
 {"ID":"SW75118","PRO":"Captain Phasma","GRAP":"Phasma.jpg","COST":"20.99","MSRP":"29.99","QTYH":"10","QTYB":"30","ITEM":"Command the troops with Captain Phasma! Give the order to advance. If the Resistance comes close, fire the shooter or leap into battle with Phasma s cool cape and metallic-look armor. The Resistance is no match for this First Order leader! Buildable and highly posable Captain Phasma figure features a spring-loaded shooter with extra ammunition, holster, metallic-look armor and a special real cloth cape with red trim. Move the limbs into any battle pose. Sturdy and durable design for intense action play. Play out exciting combat scenes with this iconic character from the blockbuster Star Wars: The Force Awakens movie. Figure stands over 10 (26cm) tall.","BRAND":"Star Wars"},
 {"ID":"SW75120","PRO":"K-2SO","GRAP":"K-2SO.jpg","COST":"20.99","MSRP":"29.99","QTYH":"15","QTYB":"15","ITEM":"Infiltrate the Empire with buildable and highly posable K-2SO. This former Imperial security droid features a single double-arm-swinging battle function, tough-looking decorated head and armor elements, and is extra tall for an even more impressive figure. This durable droid is perfect for dangerous missions against the Empire. Buildable and highly posable K-2SO figure features single double-arm-swinging battle function, tough-looking decorated head and armor elements, and an extra-tall frame. Activate the single double-arm-swinging battle function. Enter battle with this ominous looking buildable figure. Move the limbs into any battle pose. Sturdy and durable design for intense action play. Play out exciting hand-to-hand combat with this exciting droid from the blockbuster movie, Star Wars: Rogue One. This figure offers an age-appropriate building experience for ages 9-14. Figure stands over 11 (29cm) tall.","BRAND":"Star Wars"},
 {"ID":"SW75121","PRO":"Imperial Death Trooper","GRAP":"Trooper.jpg","COST":"29.99","MSRP":"29.99","QTYH":"10","QTYB":"25","ITEM":"Defend the Empire s elite with this buildable and highly posable Death Trooper figure. Featuring a blaster rifle with spring-loaded shooter, blaster pistol with holster and imposing decorated armor elements including a pauldron with attachable ammo pouches, this durable Death Trooper is ready for action. Buildable and highly posable Death Trooper figure features a blaster rifle with spring-loaded shooter, blaster pistol with holster and imposing decorated armor elements. Load the blaster rifle and fire the spring-loaded shooter. Unholster the blaster pistol and get ready for battle. Move the limbs into any battle pose. Sturdy and durable design for intense action play. Recreate amazing battles with this menacing character from the blockbuster movie, Star Wars: Rogue One. This figure offers an age-appropriate building experience for ages 8-14. Figure stands over 10 (26cm) tall.","BRAND":"Star Wars"},
 {"ID":"SW75526","PRO":"Elite TIE Fighter Pilot","GRAP":"TIE_Pilot.jpg","COST":"17.79","MSRP":"24.99","QTYH":"10","QTYB":"15","ITEM":"Fly into action with the Elite TIE Fighter Pilot! Battle it out with this buildable and highly posable LEGO Star Wars Elite TIE Fighter Pilot figure. Featuring a red-striped helmet, shoulder decoration, breathing system detailing, plus a blaster rifle with spring-loaded shooter, any Star Wars fan would love flying into battle with this tough character. Buildable and highly posable Elite TIE Fighter Pilot figure features a red-striped helmet, shoulder decoration, breathing system detailing and a blaster rifle with spring-loaded shooter. Keep the Resistance at bay with the powerful spring-loaded shooter. Move the limbs into any battle pose. Extra ammo included. Features a sturdy and durable design for intense action play. Play out epic adventures from the blockbuster Star Wars: Episode VIII movie. Stands over 9 (24cm) high.","BRAND":"Star Wars"},
 {"ID":"SW75531","PRO":"Stormtrooper Commander","GRAP":"Stormtrooper.jpg","COST":"29.99","MSRP":"29.99","QTYH":"5","QTYB":"10","ITEM":"Join the battle with the 2-in-1 Stormtrooper Commander! Issue the orders with this buildable and highly posable LEGO Star Wars Stormtrooper Commander figure. Featuring a back-mounted heavy blaster with spring-loaded shooter, plus a pauldron with detachable ammo pouches, this imposing figure can be modified into a regular Stormtrooper with blaster for double the Imperial fun! Buildable and highly posable Stormtrooper Commander figure features a back-mounted heavy blaster with spring-loaded shooter, plus a pauldron with attachable ammo pouches. Modify this 2-in-1 figure to create a regular Stormtrooper with blaster. Defend against the rebels with the powerful spring-loaded shooter. Move the limbs into any battle pose. Extra ammo included. Features a sturdy and durable design for intense action play. Play out epic adventures from the amazing Star Wars universe. Stands over 9 (24cm) high.","BRAND":"Star Wars"}]
